Tekla Open API Reference for Tekla Structures 2025
ReferenceModelObjectAttribute.Origin Property
 The origin of the extrusion.
 Namespace: Tekla.Structures.Model.Collaboration
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Point Origin { get; }
Public ReadOnly Property Origin As Point
	Get
Property Value
Type: Point
See Also
Reference
ReferenceModelObjectAttribute Class
Tekla.Structures.Model.Collaboration Namespace